module Validations

#----自分の駒を選んでいるかどうか確認------------------------------------------------
  def validate_1
    if @fs == 1 && @b[@first_p].include?("^")
      puts @error_2
    elsif @fs == 2 && @b[@first_p] =~ /^\p{Han}|^\p{Hiragana}/
      puts @error_2
    elsif @b[@first_p] == "\s\s\s"
      puts @error_2
    else
    end
  end
#-------------------------------------------------------------------------------

#----選んだ駒が動ける場所があるかどうかの確認------------------------------------------
  def validate_2
  end
#-------------------------------------------------------------------------------

#----選んだ駒が何かの判別----------------------------------------------------------
  def check_1
    case @b[@first_p]
    when /歩/;
    when /香/;
    when /桂/;
    when /銀/;
    when /金/;
    when /[王玉]/;
    when /角/;
    when /飛/;
    #成駒
    when /と/;
    when /よ/;
    when /け/;
    when /ぎ/;
    when /馬/;
    when /龍/;
    else
    end
  end
#-------------------------------------------------------------------------------



end
